import time


class Заказ:
    """Класс Заказ содержит информацию о заказе."""

    счетчик_заказов = 0

    def __init__(self):
        """Конструктор класса."""
        self.заказанные_пиццы = []
        Заказ.счетчик_заказов += 1
        self.номер_заказа = Заказ.счетчик_заказов

    def __str__(self):
        """Вернуть содержимое заказа и его сумму."""
        res = f"Заказ №{self.номер_заказа}\n"
        for i, пицца in enumerate(self.заказанные_пиццы, 1):
            res += f"{i}. {пицца}\n"
        res += f"Сумма заказа: {self.сумма():.2f} р.\n"
        return res

    def добавить(self, пицца):
        """Добавить пиццу в заказ."""
        self.заказанные_пиццы.append(пицца)
        print(f"Пицца {пицца.название} добавлена!")

    def сумма(self):
        """Вернуть сумму заказа."""
        return sum(пицца.цена for пицца in self.заказанные_пиццы)

    def выполнить(self):
        """Выполнить заказ."""
        print("Заказ поступил на выполнение...")
        for пицца in self.заказанные_пиццы:
            print(f"{пицца.название}")
            пицца.подготовить()
            time.sleep(1)
            пицца.испечь()
            time.sleep(1)
            пицца.нарезать()
            time.sleep(1)
            пицца.упаковать()
            time.sleep(1)
        print(f"\nЗаказ №{self.номер_заказа} готов! Приятного аппетита!")